{"keras_version": "2.1.6", "class_name": "Sequential", "config": [{"class_name": "Lambda", "config": {"name": "lambda_4", "function": ["4wEAAAAAAAAAAQAAAAIAAABDAAAAcwwAAAB8AABkAQAbZAIAGFMpA05nAAAAAADgb0BnAAAAAAAA\n4D+pACkB2gF4cgEAAAByAQAAAPofPGlweXRob24taW5wdXQtMjItOTk3OTE1MGQxNWYwPtoIPGxh\nbWJkYT4OAAAAcwAAAAA=\n", null, null], "output_shape_type": "raw", "batch_input_shape": [null, 500, 666, 3], "dtype": "float32", "arguments": {}, "trainable": true, "function_type": "lambda", "output_shape": null}}, {"class_name": "Conv2D", "config": {"name": "conv2d_79", "activation": "relu", "activity_regularizer": null, "strides": [1, 1], "padding": "same", "bias_constraint": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "filters": 12}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_79", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_constraint": null, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_regularizer": null, "axis": -1, "momentum": 0.99, "beta_regularizer": null}}, {"class_name": "Conv2D", "config": {"name": "conv2d_80", "activation": "relu", "activity_regularizer": null, "strides": [1, 1], "padding": "same", "bias_constraint": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "filters": 12}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_80", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_constraint": null, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_regularizer": null, "axis": -1, "momentum": 0.99, "beta_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_16", "strides": [2, 2], "pool_size": [2, 2], "padding": "valid", "trainable": true, "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"name": "conv2d_81", "activation": "relu", "activity_regularizer": null, "strides": [1, 1], "padding": "same", "bias_constraint": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "filters": 24}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_81", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_constraint": null, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_regularizer": null, "axis": -1, "momentum": 0.99, "beta_regularizer": null}}, {"class_name": "Conv2D", "config": {"name": "conv2d_82", "activation": "relu", "activity_regularizer": null, "strides": [1, 1], "padding": "same", "bias_constraint": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "filters": 24}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_82", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_constraint": null, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_regularizer": null, "axis": -1, "momentum": 0.99, "beta_regularizer": null}}, {"class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_10", "data_format": "channels_last", "padding": [[0, 0], [0, 1]], "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_17", "strides": [2, 2], "pool_size": [2, 2], "padding": "valid", "trainable": true, "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"name": "conv2d_83", "activation": "relu", "activity_regularizer": null, "strides": [1, 1], "padding": "same", "bias_constraint": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "filters": 24}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_83", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_constraint": null, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_regularizer": null, "axis": -1, "momentum": 0.99, "beta_regularizer": null}}, {"class_name": "Conv2D", "config": {"name": "conv2d_84", "activation": "relu", "activity_regularizer": null, "strides": [1, 1], "padding": "same", "bias_constraint": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "filters": 24}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_84", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_constraint": null, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_regularizer": null, "axis": -1, "momentum": 0.99, "beta_regularizer": null}}, {"class_name": "Conv2D", "config": {"name": "conv2d_85", "activation": "relu", "activity_regularizer": null, "strides": [1, 1], "padding": "same", "bias_constraint": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "filters": 24}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_85", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_constraint": null, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_regularizer": null, "axis": -1, "momentum": 0.99, "beta_regularizer": null}}, {"class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_11", "data_format": "channels_last", "padding": [[1, 0], [1, 1]], "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_18", "strides": [2, 2], "pool_size": [2, 2], "padding": "valid", "trainable": true, "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"name": "conv2d_86", "activation": "relu", "activity_regularizer": null, "strides": [1, 1], "padding": "same", "bias_constraint": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "filters": 64}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_86", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_constraint": null, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_regularizer": null, "axis": -1, "momentum": 0.99, "beta_regularizer": null}}, {"class_name": "Conv2D", "config": {"name": "conv2d_87", "activation": "relu", "activity_regularizer": null, "strides": [1, 1], "padding": "same", "bias_constraint": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "filters": 64}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_87", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_constraint": null, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_regularizer": null, "axis": -1, "momentum": 0.99, "beta_regularizer": null}}, {"class_name": "Conv2D", "config": {"name": "conv2d_88", "activation": "relu", "activity_regularizer": null, "strides": [1, 1], "padding": "same", "bias_constraint": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "filters": 64}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_88", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_constraint": null, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_regularizer": null, "axis": -1, "momentum": 0.99, "beta_regularizer": null}}, {"class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_12", "data_format": "channels_last", "padding": [[1, 0], [0, 0]], "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_19", "strides": [2, 2], "pool_size": [2, 2], "padding": "valid", "trainable": true, "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"name": "conv2d_89", "activation": "relu", "activity_regularizer": null, "strides": [1, 1], "padding": "same", "bias_constraint": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "filters": 64}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_89", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_constraint": null, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_regularizer": null, "axis": -1, "momentum": 0.99, "beta_regularizer": null}}, {"class_name": "Conv2D", "config": {"name": "conv2d_90", "activation": "relu", "activity_regularizer": null, "strides": [1, 1], "padding": "same", "bias_constraint": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "filters": 64}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_90", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_constraint": null, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_regularizer": null, "axis": -1, "momentum": 0.99, "beta_regularizer": null}}, {"class_name": "Conv2D", "config": {"name": "conv2d_91", "activation": "relu", "activity_regularizer": null, "strides": [1, 1], "padding": "same", "bias_constraint": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "filters": 64}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_91", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_constraint": null, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_regularizer": null, "axis": -1, "momentum": 0.99, "beta_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_20", "strides": [2, 2], "pool_size": [2, 2], "padding": "valid", "trainable": true, "data_format": "channels_last"}}, {"class_name": "UpSampling2D", "config": {"name": "up_sampling2d_16", "data_format": "channels_last", "size": [2, 2], "trainable": true}}, {"class_name": "Conv2D", "config": {"name": "conv2d_92", "activation": "relu", "activity_regularizer": null, "strides": [1, 1], "padding": "same", "bias_constraint": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "filters": 64}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_92", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_constraint": null, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_regularizer": null, "axis": -1, "momentum": 0.99, "beta_regularizer": null}}, {"class_name": "Conv2D", "config": {"name": "conv2d_93", "activation": "relu", "activity_regularizer": null, "strides": [1, 1], "padding": "same", "bias_constraint": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "filters": 64}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_93", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_constraint": null, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_regularizer": null, "axis": -1, "momentum": 0.99, "beta_regularizer": null}}, {"class_name": "Conv2D", "config": {"name": "conv2d_94", "activation": "relu", "activity_regularizer": null, "strides": [1, 1], "padding": "same", "bias_constraint": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "filters": 64}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_94", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_constraint": null, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_regularizer": null, "axis": -1, "momentum": 0.99, "beta_regularizer": null}}, {"class_name": "UpSampling2D", "config": {"name": "up_sampling2d_17", "data_format": "channels_last", "size": [2, 2], "trainable": true}}, {"class_name": "Conv2D", "config": {"name": "conv2d_95", "activation": "relu", "activity_regularizer": null, "strides": [1, 1], "padding": "same", "bias_constraint": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "filters": 64}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_95", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_constraint": null, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_regularizer": null, "axis": -1, "momentum": 0.99, "beta_regularizer": null}}, {"class_name": "Conv2D", "config": {"name": "conv2d_96", "activation": "relu", "activity_regularizer": null, "strides": [1, 1], "padding": "same", "bias_constraint": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "filters": 64}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_96", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_constraint": null, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_regularizer": null, "axis": -1, "momentum": 0.99, "beta_regularizer": null}}, {"class_name": "Conv2D", "config": {"name": "conv2d_97", "activation": "relu", "activity_regularizer": null, "strides": [1, 1], "padding": "same", "bias_constraint": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "filters": 24}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_97", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_constraint": null, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_regularizer": null, "axis": -1, "momentum": 0.99, "beta_regularizer": null}}, {"class_name": "Cropping2D", "config": {"name": "cropping2d_10", "cropping": [[1, 0], [0, 0]], "data_format": "channels_last", "trainable": true}}, {"class_name": "UpSampling2D", "config": {"name": "up_sampling2d_18", "data_format": "channels_last", "size": [2, 2], "trainable": true}}, {"class_name": "Conv2D", "config": {"name": "conv2d_98", "activation": "relu", "activity_regularizer": null, "strides": [1, 1], "padding": "same", "bias_constraint": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "filters": 24}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_98", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_constraint": null, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_regularizer": null, "axis": -1, "momentum": 0.99, "beta_regularizer": null}}, {"class_name": "Conv2D", "config": {"name": "conv2d_99", "activation": "relu", "activity_regularizer": null, "strides": [1, 1], "padding": "same", "bias_constraint": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "filters": 24}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_99", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_constraint": null, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_regularizer": null, "axis": -1, "momentum": 0.99, "beta_regularizer": null}}, {"class_name": "Conv2D", "config": {"name": "conv2d_100", "activation": "relu", "activity_regularizer": null, "strides": [1, 1], "padding": "same", "bias_constraint": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "filters": 24}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_100", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_constraint": null, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_regularizer": null, "axis": -1, "momentum": 0.99, "beta_regularizer": null}}, {"class_name": "Cropping2D", "config": {"name": "cropping2d_11", "cropping": [[1, 0], [0, 1]], "data_format": "channels_last", "trainable": true}}, {"class_name": "UpSampling2D", "config": {"name": "up_sampling2d_19", "data_format": "channels_last", "size": [2, 2], "trainable": true}}, {"class_name": "Conv2D", "config": {"name": "conv2d_101", "activation": "relu", "activity_regularizer": null, "strides": [1, 1], "padding": "same", "bias_constraint": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "filters": 24}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_101", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_constraint": null, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_regularizer": null, "axis": -1, "momentum": 0.99, "beta_regularizer": null}}, {"class_name": "Conv2D", "config": {"name": "conv2d_102", "activation": "relu", "activity_regularizer": null, "strides": [1, 1], "padding": "same", "bias_constraint": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "filters": 12}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_102", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_constraint": null, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_regularizer": null, "axis": -1, "momentum": 0.99, "beta_regularizer": null}}, {"class_name": "Cropping2D", "config": {"name": "cropping2d_12", "cropping": [[0, 0], [0, 1]], "data_format": "channels_last", "trainable": true}}, {"class_name": "UpSampling2D", "config": {"name": "up_sampling2d_20", "data_format": "channels_last", "size": [2, 2], "trainable": true}}, {"class_name": "Conv2D", "config": {"name": "conv2d_103", "activation": "relu", "activity_regularizer": null, "strides": [1, 1], "padding": "same", "bias_constraint": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "filters": 12}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_103", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_constraint": null, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_regularizer": null, "axis": -1, "momentum": 0.99, "beta_regularizer": null}}, {"class_name": "Conv2D", "config": {"name": "conv2d_104", "activation": "linear", "activity_regularizer": null, "strides": [1, 1], "padding": "valid", "bias_constraint": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_size": [1, 1], "dilation_rate": [1, 1], "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "filters": 2}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_104", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_constraint": null, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_regularizer": null, "axis": -1, "momentum": 0.99, "beta_regularizer": null}}, {"class_name": "Flatten", "config": {"name": "flatten_4", "data_format": "channels_last", "trainable": true}}, {"class_name": "Activation", "config": {"name": "activation_4", "activation": "sigmoid", "trainable": true}}], "backend": "tensorflow"}